КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СосотоянияФайловОбмена/КонтурЛогистика_СосотоянияФайловОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СосотоянияФайловОбмена</name>
  <enumValues>
    <name>НеОтправлен</name>
  </enumValues>
  <enumValues>
    <name>НеОтправленПодписан</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОтправки</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыОшибокСтатусаТитула/КонтурЛогистика_ТипыОшибокСтатусаТитула.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыОшибокСтатусаТитула</name>
  <enumValues>
    <name>ОшибкаПодписи</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаМЧД</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаГИС</name>
  </enumValues>
  <enumValues>
    <name>ОбработанСПредупреждением</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаСервиса</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаСоединения</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_КриптографияСервер/Module.bsl
Функция ИнициализироватьМенеджерКриптографии(ПарольКонтейнера = Неопределено, ТипМодуляКриптографии = Неопределено) Экспорт
	
	Возврат КонтурЛогистика_КриптографияКлиентСервер.ИнициализироватьМенеджерКриптографии(ПарольКонтейнера, ТипМодуляКриптографии);
	
КонецФункции

Функция ПолучитьСписокЛокальныхСертификатов() Экспорт
	
	Возврат КонтурЛогистика_КриптографияКлиентСервер.ПолучитьСписокЛокальныхСертификатов();	
	
КонецФункции

Функция ПолучитьДанныеСертификата(МенеджерКриптографии, ОтпечатокСертификата, ПараметрыПоиска, СвойстваСертификата) Экспорт
	
	Возврат КонтурЛогистика_КриптографияКлиентСервер.ПолучитьДанныеСертификата(МенеджерКриптографии,
																			   ОтпечатокСертификата, 
																			   ПараметрыПоиска, 
																			   СвойстваСертификата);
	
КонецФункции
																		   
Функция ПолучитьДвоичныеДанныеСертификата(ОтпечатокСертификата, ТипМодуляКриптографии = Неопределено) Экспорт
	
	Возврат КонтурЛогистика_КриптографияКлиентСервер.ПолучитьДвоичныеДанныеСертификата(ОтпечатокСертификата, ТипМодуляКриптографии);
	
КонецФункции

Функция ПодписатьДанные(ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера = Неопределено, ТипМодуляКриптографии, ИспользоватьИнтерактивныйРежим = Ложь, 
	ФайлОбмена = Неопределено, ВернутьОшибку = Ложь) Экспорт

	Возврат КонтурЛогистика_КриптографияКлиентСервер.ПодписатьДанные(
		ДвоичныеДанные, ОтпечатокСертификата, ПарольКонтейнера, ТипМодуляКриптографии, ИспользоватьИнтерактивныйРежим, ФайлОбмена, ВернутьОшибку);
	
КонецФункции
																 
Функция РасшифроватьДанные(ЗашифрованныеДвоичныеДанные, ПарольКонтейнера = "", ТипМодуляКриптографии = Неопределено, ИспользоватьИнтерактивныйРежим = Ложь) Экспорт

	Возврат КонтурЛогистика_КриптографияКлиентСервер.РасшифроватьДанные(ЗашифрованныеДвоичныеДанные, ПарольКонтейнера, ТипМодуляКриптографии, ИспользоватьИнтерактивныйРежим);
	
КонецФункции
	
Функция ПолучитьТипыМодуляКриптографии() Экспорт
	
	КриптоПроГОСТ2011 = Новый Структура("ИмяМодуляКриптографии, ТипМодуляКриптографии");
	КриптоПроГОСТ2011.Вставить("ТипМодуляКриптографии", 75);
	КриптоПроГОСТ2011.Вставить("ИмяМодуляКриптографии", "Crypto-Pro GOST R 34.10-2001 Cryptographic Service Provider");
	КриптоПроГОСТ2011.Вставить("ИмяДляВыбора", "Crypto-Pro GOST R 34.10-2001 Cryptographic Service Provider");
	
	КриптоПроГОСТ2012 = Новый Структура("ИмяМодуляКриптографии, ТипМодуляКриптографии");
	КриптоПроГОСТ2012.Вставить("ТипМодуляКриптографии", 80);
	КриптоПроГОСТ2012.Вставить("ИмяМодуляКриптографии", "Crypto-Pro GOST R 34.10-2012 Cryptographic Service Provider");
	КриптоПроГОСТ2012.Вставить("ИмяДляВыбора", "КриптоПро CSP (ГОСТ 2012/256)");

	КриптоПроГОСТ2012Усиленный = Новый Структура("ИмяМодуляКриптографии, ТипМодуляКриптографии");
	КриптоПроГОСТ2012Усиленный.Вставить("ТипМодуляКриптографии", 81);
	КриптоПроГОСТ2012Усиленный.Вставить("ИмяМодуляКриптографии", 
		"Crypto-Pro GOST R 34.10-2012 Strong Cryptographic Service Provider");
	КриптоПроГОСТ2012Усиленный.Вставить("ИмяДляВыбора", "КриптоПро CSP (ГОСТ 2012/512)");
	
	КриптоПроФКН = Новый Структура("ИмяМодуляКриптографии, ТипМодуляКриптографии");
	КриптоПроФКН.Вставить("ТипМодуляКриптографии", 75);
	КриптоПроФКН.Вставить("ИмяМодуляКриптографии", "GOST R 34.10-2001 eToken CSP");
	КриптоПроФКН.Вставить("ИмяДляВыбора", "GOST R 34.10-2001 eToken CSP");
	
	КриптоПроРутокен = Новый Структура("ИмяМодуляКриптографии, ТипМодуляКриптографии");
	КриптоПроРутокен.Вставить("ТипМодуляКриптографии", 75);
	КриптоПроРутокен.Вставить("ИмяМодуляКриптографии", "GOST R 34.10-2001 Rutoken CSP");
	КриптоПроРутокен.Вставить("ИмяДляВыбора", "GOST R 34.10-2001 Rutoken CSP");
	
	ВИПНетГОСТ2011 = Новый Структура("ИмяМодуляКриптографии, ТипМодуляКриптографии");		
	ВИПНетГОСТ2011.Вставить("ТипМодуляКриптографии", 2);
	ВИПНетГОСТ2011.Вставить("ИмяМодуляКриптографии", "Infotecs Cryptographic Service Provider");
	ВИПНетГОСТ2011.Вставить("ИмяДляВыбора", "ViPNet CSP (ГОСТ 2001)");
	
	ВИПНетГОСТ2012 = Новый Структура("ИмяМодуляКриптографии, ТипМодуляКриптографии");		
	ВИПНетГОСТ2012.Вставить("ТипМодуляКриптографии", 77);
	ВИПНетГОСТ2012.Вставить("ИмяМодуляКриптографии", "Infotecs GOST 2012/512 Cryptographic Service Provider");
	ВИПНетГОСТ2012.Вставить("ИмяДляВыбора", "ViPNet CSP (ГОСТ 2012/256)");
	
	ВИПНетГОСТ2012Усиленный = Новый Структура("ИмяМодуляКриптографии, ТипМодуляКриптографии");		
	ВИПНетГОСТ2012Усиленный.Вставить("ТипМодуляКриптографии", 78);
	ВИПНетГОСТ2012Усиленный.Вставить("ИмяМодуляКриптографии", "Infotecs GOST 2012/1024 Cryptographic Service Provider");
	ВИПНетГОСТ2012Усиленный.Вставить("ИмяДляВыбора", "ViPNet CSP (ГОСТ 2012/512)");
	
	ПоддерживаемыеТипы = Новый Массив;
	ПоддерживаемыеТипы.Добавить(КриптоПроГОСТ2012);
	ПоддерживаемыеТипы.Добавить(КриптоПроГОСТ2012Усиленный);
	ПоддерживаемыеТипы.Добавить(КриптоПроГОСТ2011);
	//ПоддерживаемыеТипы.Добавить(КриптоПроФКН);
	//ПоддерживаемыеТипы.Добавить(КриптоПроРутокен);
	ПоддерживаемыеТипы.Добавить(ВИПНетГОСТ2011);
	ПоддерживаемыеТипы.Добавить(ВИПНетГОСТ2012);
	ПоддерживаемыеТипы.Добавить(ВИПНетГОСТ2012Усиленный);
	
	Возврат ПоддерживаемыеТипы;
	
КонецФункции

Функция СтатусыПроверкиСертификата()
	
	СписокСтатусов = Новый Соответствие;
	СписокСтатусов.Вставить(262144,		"Список доверия сертификатов (CTL) содержит недопустимую подпись.");
	СписокСтатусов.Вставить(131072,		"Список доверия сертификатов (CTL) является недопустимым из-за недопустимого значения времени (например, значения, указывающего, что срок действия списка CTL истек).");
	СписокСтатусов.Вставить(524288,		"Список доверия сертификатов (CTL) недопустим для использования в данном случае.");
	СписокСтатусов.Вставить(128, 		"Невозможность построения цепочки X509.");
	СписокСтатусов.Вставить(67108864,	"Сертификат явно не является доверенным.");
	СписокСтатусов.Вставить(32768,		"Цепочка X509 является недопустимой, так как сертификат исключил ограничение имен.");
	СписокСтатусов.Вставить(8192,		"Сертификат имеет неопределенное ограничение имен.");
	СписокСтатусов.Вставить(16384,		"Сертификат имеет недопустимое ограничение имен.");
	СписокСтатусов.Вставить(134217728,	"Сертификат не поддерживает критическое расширение.");
	СписокСтатусов.Вставить(4096,		"У сертификата отсутствует поддерживаемое ограничение имен или имеется неподдерживаемое ограничение имен.");
	СписокСтатусов.Вставить(1048576,	"Сертификат не был подписан с помощью надежной подписи. Как правило, это означает, что для создания хэша сертификата использовались алгоритмы хэширования MD2 или MD5.");
	СписокСтатусов.Вставить(1024,		"Цепочка X509 является недопустимой из-за недопустимых базовых ограничений.");
	СписокСтатусов.Вставить(256,		"Цепочка X509 является недопустимой из-за недопустимого расширения.");
	СписокСтатусов.Вставить(22048,		"Цепочка X509 является недопустимой из-за недопустимых ограничений имен.");
	СписокСтатусов.Вставить(512,		"Цепочка X509 является недопустимой из-за недопустимых ограничений политик.");
	СписокСтатусов.Вставить(0,			"Цепочка X509 не содержит ошибок.");
	СписокСтатусов.Вставить(33554432,	"В сертификате отсутствует расширение политики сертификата. Эта ошибка возникает в том случае, если групповая политика указала, что все сертификаты должны иметь политику сертификата.");
	СписокСтатусов.Вставить(8,			"Цепочка X509 является недопустимой из-за недопустимой подписи сертификата.");
	СписокСтатусов.Вставить(2,			"Сертификат ЦС (центра сертификации) и выданный сертификат имеют сроки действия, которые не являются вложенными. Например, сертификат ЦС может действовать с 1 января по 1 декабря, а выданный сертификат — со 2 января по 2 декабря, что означает, что сроки действия не являются вложенными.");
	СписокСтатусов.Вставить(1,			"Цепочка X509 является недопустимой из-за недопустимого значения времени (например, значения, указывающего сертификат с истекшим сроком действия).");
	СписокСтатусов.Вставить(16,			"Использование ключа недопустимо.");
	СписокСтатусов.Вставить(16777216,	"Веб-список отзыва сертификатов (CRL), от которого зависит цепочка X509, в настоящий момент находится в автономном режиме.");
	СписокСтатусов.Вставить(65536,		"Невозможность построения цепочки X509 до корневого сертификата.");
	СписокСтатусов.Вставить(64,			"Невозможно определить, был ли сертификат отозван. Это может быть вызвано с тем, что список отзыва сертификатов (CRL) отключен или недоступен.");
	СписокСтатусов.Вставить(4,			"Цепочка X509 является недопустимой из-за отозванного сертификата.");
	СписокСтатусов.Вставить(32,			"Цепочка X509 является недопустимой из-за ненадежного корневого сертификата.");
	
	Возврат СписокСтатусов;
	
КонецФункции

Функция ПолучитьСтатусПроверкиСертификатаПоКоду(Код) Экспорт
	
	СписокСтатусов = СтатусыПроверкиСертификата();
	
	Возврат СписокСтатусов[Код];
	
КонецФункции

Процедура ДобавитьОшибкуКриптографииВСтатусТитула(ФайлОбмена, Код, ОписаниеОшибки, ИсточникОшибки) Экспорт
	
	ФайлОбменаОбъект = ФайлОбмена.ПолучитьОбъект();	
	ФайлОбменаОбъект.Состояние = Перечисления.КонтурЛогистика_СосотоянияФайловОбмена.ОшибкаОтправки;
	ФайлОбменаОбъект.Записать();
			
	СтруктураОшибки = Новый Структура;
	СтруктураОшибки.Вставить("ТипОшибки", Перечисления.КонтурЛогистика_ТипыОшибокСтатусаТитула.ОшибкаПодписи);
	
	СтруктураОшибки.Вставить("КодОшибки", Код);
	СтруктураОшибки.Вставить("ОписаниеОшибки", ИсточникОшибки);
	СтруктураОшибки.Вставить("ПодробноеОписаниеОшибки", ОписаниеОшибки);
			
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(
		ФайлОбмена.СвязанныйДокумент, Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка, , , СтруктураОшибки);
	
	КонецПроцедуры
	
Функция ПолучитьДанныеОшибкиКриптографии(Документ) Экспорт
	
	СтатусРасширенный =  РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатусРасширенный(Документ);
	
	Результат = Новый Структура;
	Результат.Вставить("КодОшибки", СтатусРасширенный.КодОшибки);
	Результат.Вставить("ПодробноеОписаниеОшибки", СтатусРасширенный.ПодробноеОписаниеОшибки);
	
	Возврат Результат;
	
КонецФункции
